# Pandas

**Pandas** is a package for data manipulation and analysis in Python. The name Pandas is derived from the econometrics term Panel Data. Pandas incorporates two additional data structures into Python, namely **Pandas Series** and **Pandas DataFrame**. These data structures allow us to work with labeled and relational data in an easy and intuitive manner.

 - [Pandas Documentation](https://pandas.pydata.org/pandas-docs/stable/)
 - [Pandas Reference - Series](https://pandas.pydata.org/pandas-docs/stable/reference/series.html)
 - [Pandas Reference - DataFrame](https://pandas.pydata.org/pandas-docs/stable/reference/frame.html)
 - [Pandas - Intro to data structures](https://pandas.pydata.org/pandas-docs/stable/user_guide/dsintro.html)

## Installation

Pandas is included with Anaconda.

Install Pandas:
```sh
conda install pandas=0.22
```

## Pandas Series

A Pandas series is a one-dimensional array-like object that can hold many data types, such as numbers or strings, and has an option to provide axis labels.

In [26]:
import pandas as pd

groceries = pd.Series(data=[30,6,'Yes','No'], index=['eggs', 'apples', 'milk', 'bread'], name="Groceries")

groceries

eggs       30
apples      6
milk      Yes
bread      No
Name: Groceries, dtype: object

### Series Attributes

In [27]:
print("Shape of data [Series.shape]: ", groceries.shape)
print("Number of dimensions [Series.ndim]: ", groceries.ndim)
print("Number of elements [Series.size]: ", groceries.size)
print("Number of bytes [Series.nbytes]: ", groceries.size)
print("Number of bytes [Series.nbytes]: ", groceries.size)

print("Index labels [Series.index]: ", groceries.index)
print("Values [Series.values]: ", groceries.values)

Shape of data [Series.shape]:  (4,)
Number of dimensions [Series.ndim]:  1
Number of elements [Series.size]:  4
Number of bytes [Series.nbytes]:  4
Number of bytes [Series.nbytes]:  4
Index labels [Series.index]:  Index(['eggs', 'apples', 'milk', 'bread'], dtype='object')
Values [Series.values]:  [30 6 'Yes' 'No']

### Access and Delete Elements

In [28]:
# assign new value
groceries['eggs'] = 50

# remove element
groceries.drop('apples', inplace=True)

print("Value at index label 'eggs':", groceries['eggs'])
print("Value at numerical index 0:", groceries[0])
print("Series from indexes 'milk' and 'bread':\n", groceries[['milk', 'bread']], '\n')
print("Value at index label (explicitly):", groceries.loc['milk'])

Value at index label 'eggs': 50
Value at numerical index 0: 50
Series from indexes 'milk' and 'bread':
 milk     Yes
bread     No
Name: Groceries, dtype: object

Value at index label (explicitly): Yes

### Arithmetic Operations on Series

In [33]:
# create a panda series that stores a list of fruits
fruits= pd.Series(data = [10, 6, 3], index = ['apples', 'oranges', 'bananas'])

fruits

apples     10
oranges     6
bananas     3
dtype: int64

In [31]:
# We print fruits for reference
print('Original grocery list of fruits:\n ', fruits)

# We perform basic element-wise operations using arithmetic symbols
print('fruits + 2:\n', fruits + 2) # We add 2 to each item in fruits
print('fruits - 2:\n', fruits - 2) # We subtract 2 to each item in fruits
print('fruits * 2:\n', fruits * 2) # We multiply each item in fruits by 2 
print('fruits / 2:\n', fruits / 2) # We divide each item in fruits by 2

Original grocery list of fruits:
  apples     10
oranges     6
bananas     3
dtype: int64
fruits + 2:
 apples     12
oranges     8
bananas     5
dtype: int64
fruits - 2:
 apples     8
oranges    4
bananas    1
dtype: int64
fruits * 2:
 apples     20
oranges    12
bananas     6
dtype: int64
fruits / 2:
 apples     5.0
oranges    3.0
bananas    1.5
dtype: float64

## DataFrames

Pandas DataFrames are two-dimensional data structures with labeled rows and columns, that can hold many data types. If you are familiar with Excel, you can think of Pandas DataFrames as being similar to a spreadsheet.

In [35]:
# create a dictionary of Pandas Series 
items = {
    'Bob' :   pd.Series(data = [245, 25, 55], index = ['bike', 'pants', 'watch']),
    'Alice' : pd.Series(data = [40, 110, 500, 45], index = ['book', 'glasses', 'bike', 'pants'])
}

# create a DataFrame from dictionary of series
shopping_carts = pd.DataFrame(items)

shopping_carts

           Bob  Alice
bike     245.0  500.0
book       NaN   40.0
glasses    NaN  110.0
pants     25.0   45.0
watch     55.0    NaN

In [42]:
# create a list of dictionaries
items3 = [{'bikes': 20, 'pants': 30, 'watches': 35, 'shirts': 15, 'shoes':8, 'suits':45},
{'watches': 10, 'glasses': 50, 'bikes': 15, 'pants':5, 'shirts': 2, 'shoes':5, 'suits':7},
{'bikes': 20, 'pants': 30, 'watches': 35, 'glasses': 4, 'shoes':10}]

# create a DataFrame 
store_items = pd.DataFrame(items3, index=['store 1', 'store 2', 'store 3'])

store_items

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1     20     30       35    15.0      8   45.0      NaN
store 2     15      5       10     2.0      5    7.0     50.0
store 3     20     30       35     NaN     10    NaN      4.0

### Accessing Elements in DataFrames

In [43]:
print('How many bikes are in each store:\n', store_items[['bikes']], '\n')
print('How many bikes and pants are in each store:\n', store_items[['bikes', 'pants']], '\n')
print('What items are in Store 1:\n', store_items.loc[['store 1']], '\n')
print('How many bikes are in Store 2:', store_items['bikes']['store 2'], '\n')

How many bikes are in each store:
          bikes
store 1     20
store 2     15
store 3     20

How many bikes and pants are in each store:
          bikes  pants
store 1     20     30
store 2     15      5
store 3     20     30

What items are in Store 1:
          bikes  pants  watches  shirts  shoes  suits  glasses
store 1     20     30       35    15.0      8   45.0      NaN

How many bikes are in Store 2: 15

### Dealing with NaN

In [44]:
store_items

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1     20     30       35    15.0      8   45.0      NaN
store 2     15      5       10     2.0      5    7.0     50.0
store 3     20     30       35     NaN     10    NaN      4.0

In [45]:
# count the number of NaN values in store_items
x =  store_items.isnull().sum().sum()

print('Number of NaN values in our DataFrame:', x)

Number of NaN values in our DataFrame: 3

In [46]:
# Return boolean True/False for each element if it is a NaN
store_items.isnull()

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1  False  False    False   False  False  False     True
store 2  False  False    False   False  False  False    False
store 3  False  False    False    True  False   True    False

In [47]:
# Count NaN down the column
store_items.isnull().sum()

bikes      0
pants      0
watches    0
shirts     1
shoes      0
suits      1
glasses    1
dtype: int64

In [49]:
# Number of non-NaN values in the columns of our DataFrame
store_items.count()

bikes      3
pants      3
watches    3
shirts     2
shoes      3
suits      2
glasses    2
dtype: int64

In [50]:
# Drop rows having NaN values
store_items.dropna(axis = 0)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 2     15      5       10     2.0      5    7.0     50.0

In [51]:
# Drop columns having NaN values
store_items.dropna(axis = 1)

         bikes  pants  watches  shoes
store 1     20     30       35      8
store 2     15      5       10      5
store 3     20     30       35     10

In [52]:
# Replace NaN with 0
store_items.fillna(0)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1     20     30       35    15.0      8   45.0      0.0
store 2     15      5       10     2.0      5    7.0     50.0
store 3     20     30       35     0.0     10    0.0      4.0

In [54]:
# forward fill Nan values with previous values
store_items.fillna(method = 'ffill', axis=1)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1   20.0   30.0     35.0    15.0    8.0   45.0     45.0
store 2   15.0    5.0     10.0     2.0    5.0    7.0     50.0
store 3   20.0   30.0     35.0    35.0   10.0   10.0      4.0

In [55]:
# replace NaN values by using linear interpolation using column values
store_items.interpolate(method = 'linear', axis = 0)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1     20     30       35    15.0      8   45.0      NaN
store 2     15      5       10     2.0      5    7.0     50.0
store 3     20     30       35     2.0     10    7.0      4.0

### Load data into DataFrame

In [58]:
# read DataFrame from a CSV file
Google_stock = pd.read_csv('./data/google.csv')

Google_stock.head()

         Date       Open       High        Low      Close  Adj Close    Volume
0  2004-08-19  49.676899  51.693783  47.669952  49.845802  49.845802  44994500
1  2004-08-20  50.178635  54.187561  49.925285  53.805050  53.805050  23005800
2  2004-08-23  55.017166  56.373344  54.172661  54.346527  54.346527  18393200
3  2004-08-24  55.260582  55.439419  51.450363  52.096165  52.096165  15361800
4  2004-08-25  52.140873  53.651051  51.604362  52.657513  52.657513   9257400

In [57]:
Google_stock.describe()

              Open         High  ...    Adj Close        Volume
count  3313.000000  3313.000000  ...  3313.000000  3.313000e+03
mean    380.186092   383.493740  ...   380.072458  8.038476e+06
std     223.818650   224.974534  ...   223.853780  8.399521e+06
min      49.274517    50.541279  ...    49.681866  7.900000e+03
25%     226.556473   228.394516  ...   226.407440  2.584900e+06
50%     293.312286   295.433502  ...   293.029114  5.281300e+06
75%     536.650024   540.000000  ...   536.690002  1.065370e+07
max     992.000000   997.210022  ...   989.679993  8.276810e+07

[8 rows x 6 columns]

In [59]:
Google_stock.isnull().any()

Date         False
Open         False
High         False
Low          False
Close        False
Adj Close    False
Volume       False
dtype: bool

In [60]:
# the correlation between columns
Google_stock.corr()

               Open      High       Low     Close  Adj Close    Volume
Open       1.000000  0.999904  0.999845  0.999745   0.999745 -0.564258
High       0.999904  1.000000  0.999834  0.999868   0.999868 -0.562749
Low        0.999845  0.999834  1.000000  0.999899   0.999899 -0.567007
Close      0.999745  0.999868  0.999899  1.000000   1.000000 -0.564967
Adj Close  0.999745  0.999868  0.999899  1.000000   1.000000 -0.564967
Volume    -0.564258 -0.562749 -0.567007 -0.564967  -0.564967  1.000000

In [62]:
# We load fake Company data in a DataFrame
data = pd.read_csv('./data/fake-company.csv')

data

   Year     Name Department  Age  Salary
0  1990    Alice         HR   25   50000
1  1990      Bob         RD   30   48000
2  1990  Charlie      Admin   45   55000
3  1991   Dakota         HR   26   52000
4  1991     Elsa         RD   31   50000
5  1991    Frank      Admin   46   60000
6  1992    Grace      Admin   27   60000
7  1992  Hoffman         RD   32   52000
8  1992    Inaar      Admin   28   62000

In [63]:
data.groupby(['Year'])['Salary'].sum()

Year
1990    153000
1991    162000
1992    174000
Name: Salary, dtype: int64

## Glossary

### Category: Initialization and Utility

- `pandas.read_csv(relative_path_to_file)` - Reads a comma-separated values (csv) file present at relative_path_to_file and loads it as a DataFrame
- `pandas.DataFrame(data)` - Returns a 2-D heterogeneous tabular data. Note: There are other optional arguments as well that you can use to create a dataframe.
- `pandas.Series(data, index)` - Returns 1-D ndarray with axis labels
- `pandas.DataFrame.shape` or `pandas.Series.shape` - Returns a tuple representing the dimensions
- `pandas.DataFrame.ndim` or `pandas.Series.ndim` - Returns the number of the dimensions (rank). It will return 1 in case of a Series
- `pandas.DataFrame.size` or `pandas.Series.size` - Returns the number of elements
- `pandas.Series.values` - Returns the data available in the Series
- `pandas.Series.index` - Returns the indexes available in the Series
- `pandas.DataFrame.isnull()` - Returns a same sized object having True for NaN elements and False otherwise.
- `pandas.DataFrame.count(axis)` - Returns the count of non-NaN values along the given axis. If axis=0, it will count down the dataframe, meaning column-wise count of non-NaN values.
- `pandas.DataFrame.head([n])` - Return the first n rows from the dataframe. By default, n=5.
- `pandas.DataFrame.tail([n])` - Return the last n rows from the dataframe. By default, n=5. Supports negative indexing as well.
- `pandas.DataFrame.describe()` - Generate the descriptive statistics, such as, count, mean, std deviation, min, and max.
- `pandas.DataFrame.min()` - Returns the minimum of the values along the given axis.
- `pandas.DataFrame.max()` - Returns the maximum of the values along the given axis.
- `pandas.DataFrame.mean()` - Returns the mean of the values along the given axis.
- `pandas.DataFrame.corr()` - Compute pairwise correlation of columns, excluding NA/null values.
- `pandas.DataFrame.rolling(windows)` - Provide rolling window calculation, such as pandas.DataFrame.rolling(15).mean() for rolling mean over window size of 15.
- `pandas.DataFrame.loc[label]` - Access a group of rows and columns by label(s)
- `pandas.DataFrame.groupby(mapping_function)` - Groups the dataframe using a given mapper function or or by a Series of columns.

### Category: Manipulation

- `pandas.Series.drop(index)` - Drops the element positioned at the given index(es)
- `pandas.DataFrame.drop(labels)` - Drop specified labels (entire columns or rows) from the dataframe.
- `pandas.DataFrame.pop(item)` - Return the item and drop it from the frame. If not found, then raise a KeyError.
- `pandas.DataFrame.insert(location, column, values)` - Insert column having given values into DataFrame at specified location.
- `pandas.DataFrame.rename(dictionary-like)` - Rename label(s) (columns or row-indexes) as mentioned in the dictionary-like
- `pandas.DataFrame.set_index(keys)` - Set the DataFrame's row-indexes using existing column-values.
- `pandas.DataFrame.dropna(axis)` - Remove rows (if axis=0) or columns (if axis=1) that contain missing values.
- `pandas.DataFrame.fillna(value, method, axis)` - Replace NaN values with the specified value along the given axis, and using the given method (‘backfill’, ‘bfill’, ‘pad’, ‘ffill’, None)
- `pandas.DataFrame.interpolate(method, axis)` - Replace the NaN values with the estimated value calculated using the given method along the given axis.